name: "postprocessing_english_stt"
backend: "python"

max_batch_size: 8

dynamic_batching {
  max_queue_delay_microseconds: 10000
}

instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]

input [
  {
    name: "asr_output"
    data_type: TYPE_FP32
    dims: [-1, 1025]
  }
]

output [
  {
    name: "decoded_texts"
    data_type: TYPE_STRING
    dims: [1]
  }
]