name: "tensorrt_english_stt"
platform: "tensorrt_plan"

max_batch_size: 8

dynamic_batching {
  max_queue_delay_microseconds: 10000
}

instance_group [
  {
    kind: KIND_GPU
    gpus: [ 0 ]
    count: 2
  }
]

input [
    {
        name: "signal",
        data_type: TYPE_FP32,
        dims: [80, -1]
    }
]

output [
    {
        name: "output",
        data_type: TYPE_FP32,
        dims: [-1, 1025],
    }
]